namespace Exercise_4;

/*
                            Задание 4
Создать абстрактный базовый класс Worker (работника) с методом Print().
Создайте четыре производных класса:
President,
Security,
Manager,
Engineer.
Переопределите метод
Print() для вывода информации, соответствующей каждому типу работника.
 */

class Program
{
    static void Main(string[] args)
    {
        Console.WriteLine("Hello, World!");
    }
}

