namespace Exercise_1;

/*
                                Задание 1
Создайте интерфейс ICalc. В нём должно быть два метода:
■ intLess(intvalueToCompare) — возвращает количество значений меньших, чем valueToCompare;
■ intGreater(int valueToCompare) — возвращает количество значений больших, чем valueToCompare.
Класс, созданный ранее в практическом задании Array, должен имплементировать интерфейс ICalc.
Метод Less — возвращает количество элементов массива меньших, чем valueToCompare.
Метод Greater — возвращает количество элементов массива больших, чем valueToCompare.
Напишите код для тестирования полученной функциональности.
 */

class Program
{
    static void Main(string[] args)
    {
        Console.WriteLine("Hello, World!");
    }
}

