namespace Exercise_1;

/*
 Задание 1
Создайте приложение для менеджмента сотрудников и паролей
Необходимо хранить следующую информацию:
    - Логины сотрудников
    - Пароли сотрудников
Для хранения информации используйте Dictionary<T>
Приложение должно представлять такую функциональность:
    - Добавление логина и пароля сотрудникам
    - Удаление логина сотрудника
    - Изменение информации о логине и пароле сотрудника
    - Полусение информации о пароле по логину сотрудника

*/

class Program
{
    static void Main(string[] args)
    {

        Console.Read();
    }
}

